In [1]:
import sqlalchemy
from google.cloud import bigquery
from sqlalchemy.engine import create_engine

import pandas as pd

from google.oauth2 import service_account

In [2]:
credentials_json_path = "credentials_view.json"

credentials = service_account.Credentials.from_service_account_file(
    credentials_json_path, scopes=["https://www.googleapis.com/auth/cloud-platform"],
)

bqclient = bigquery.Client(credentials=credentials, project=credentials.project_id)

In [3]:
# PROJECT_ID = credentials.project_id
# DB_NAME = "house_data"
# DATASET = "london_house_prices"

In [4]:
# Download a table.
table = bigquery.TableReference.from_string(
    "candidate-testing.house_data.london_house_prices"
)
rows = bqclient.list_rows(
    table
)
df = rows.to_dataframe()

In [5]:
df.head()

,address,type,bedrooms,latitude,longitude,area,price,tenure,is_newbuild,date
0,"Flat 3, Warwick Apartments, 132, Cable Street,...",Flat,1,51.51092,-0.06250,E1,299995,Leasehold,1,2014-01-28 00:00:00+00:00
1,"Flat 3, Warwick Apartments, 132, Cable Street,...",Flat,1,51.51092,-0.06250,E1,445000,Leasehold,0,2019-06-20 00:00:00+00:00
2,"25, Varden Street, London, Greater London E1 2AW",Terraced,3,51.51576,-0.06128,E1,300000,Freehold,0,2007-04-20 00:00:00+00:00
3,"25, Varden Street, London, Greater London E1 2AW",Terraced,3,51.51576,-0.06128,E1,1350000,Freehold,0,2020-11-27 00:00:00+00:00
4,"22b Petticoat Tower, Petticoat Square, London,...",Flat,1,51.51575,-0.07714,E1,249950,Leasehold,0,2014-11-07 00:00:00+00:00

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690063 entries, 0 to 690062
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   address      690063 non-null  object
 1   type         690063 non-null  object
 2   bedrooms     690063 non-null  int64
 3   latitude     690063 non-null  float64
 4   longitude    690063 non-null  float64
 5   area         690063 non-null  object
 6   price        690063 non-null  int64
 7   tenure       690063 non-null  object
 8   is_newbuild  690063 non-null  int64
 9   date         690063 non-null  datetime64[ns, UTC]
dtypes: datetime64[ns, UTC](1), float64(2), int64(3), object(4)
memory usage: 52.6+ MB

In [7]:
df['address'].value_counts()

66, Nansen Road, London, Greater London SW11 5NT                                           1764
6, Elmbourne Road, London, Greater London SW17 8JR                                         1540
26, Longfield Street, London, Greater London SW18 5RE                                      1530
38, Island Row, London, Greater London E14 7HU                                             1476
75, Muncaster Road, London, Greater London SW11 6NX                                        1470
                                                                                           ...
32, Blackberry Court, Queen Mary Avenue, South Woodford, London, Greater London E18 2GF       1
33, Blackberry Court, Queen Mary Avenue, South Woodford, London, Greater London E18 2GF       1
18, Blackberry Court, Queen Mary Avenue, South Woodford, London, Greater London E18 2GF       1
30, Blackberry Court, Queen Mary Avenue, South Woodford, London, Greater London E18 2GF       1
11, Perth Close, London, Greater London SW20 0AJ                                              1
Name: address, Length: 111196, dtype: int64

In [8]:
df[df.address=='66, Nansen Road, London, Greater London SW11 5NT']

,address,type,bedrooms,latitude,longitude,area,price,tenure,is_newbuild,date
588008,"66, Nansen Road, London, Greater London SW11 5NT",Terraced,4,51.46421,-0.15431,SW11,775000,Freehold,0,2009-10-28 00:00:00+00:00
588009,"66, Nansen Road, London, Greater London SW11 5NT",Semi-Detached,4,51.46421,-0.15431,SW11,775000,Freehold,0,2009-10-28 00:00:00+00:00
588010,"66, Nansen Road, London, Greater London SW11 5NT",Semi-Detached,4,51.46421,-0.15431,SW11,775000,Freehold,0,2009-10-28 00:00:00+00:00
588011,"66, Nansen Road, London, Greater London SW11 5NT",Semi-Detached,4,51.46421,-0.15431,SW11,775000,Freehold,0,2009-10-28 00:00:00+00:00
588012,"66, Nansen Road, London, Greater London SW11 5NT",Terraced,4,51.46421,-0.15431,SW11,775000,Freehold,0,2009-10-28 00:00:00+00:00
...,...,...,...,...,...,...,...,...,...,...
589774,"66, Nansen Road, London, Greater London SW11 5NT",Semi-Detached,4,51.46421,-0.15431,SW11,1300000,Freehold,0,2019-12-19 00:00:00+00:00
589775,"66, Nansen Road, London, Greater London SW11 5NT",Semi-Detached,4,51.46421,-0.15431,SW11,1300000,Freehold,0,2019-12-19 00:00:00+00:00
589776,"66, Nansen Road, London, Greater London SW11 5NT",Terraced,4,51.46421,-0.15431,SW11,1300000,Freehold,0,2019-12-19 00:00:00+00:00
589777,"66, Nansen Road, London, Greater London SW11 5NT",Semi-Detached,4,51.46421,-0.15431,SW11,1300000,Freehold,0,2019-12-19 00:00:00+00:00
589778,"66, Nansen Road, London, Greater London SW11 5NT",Semi-Detached,4,51.46421,-0.15431,SW11,1300000,Freehold,0,2019-12-19 00:00:00+00:00

In [9]:
df = df.drop_duplicates().reset_index(drop=True)
df.shape

(241007, 10)

In [ ]:
# df = df.drop(['type'],axis=1).drop_duplicates(keep=False)
# df = df.drop(['bedrooms'],axis=1).drop_duplicates(keep=False)

# df = df.drop(['latitude'],axis=1).drop_duplicates(keep=False)
# df = df.drop(['longitude'],axis=1).drop_duplicates(keep=False)

In [ ]:
# df.drop(['address'],axis=1).drop_duplicates(keep=False).shape

In [130]:
import re

In [131]:
sample_sentence = '6, Polworth, London, Greater London SW16 2EU'

In [132]:
road_matcher = re.compile(r'(\w+\s?\w+),\s?London,')
def extract_road(x):
    res = road_matcher.findall(x)
    if res:
        return res[0]
    return None

extract_road(sample_sentence)

'Polworth'

In [133]:
df['road'] = df['address'].apply(extract_road)

In [134]:
df['road']

0             Cable Street
1             Cable Street
2            Varden Street
3            Varden Street
4         Petticoat Square
                ...
241002         Perth Close
241003         Perth Close
241004         Perth Close
241005         Perth Close
241006         Perth Close
Name: road, Length: 241007, dtype: object

In [117]:
# df['road'].value_counts()

In [135]:
df['road'].isna().sum()

6

In [119]:
df[df['road'].isna()]['address']

95630    Flat 14, Vermont House, 4, Quayle Crescent, Ba...
95632    Flat 5, Vermont House, 4, Quayle Crescent, Bar...
95634    Flat 8, Vermont House, 4, Quayle Crescent, Bar...
95635    Flat 13, Vermont House, 4, Quayle Crescent, Ba...
Name: address, dtype: object

In [120]:
df.iloc[95632]['address']

'Flat 5, Vermont House, 4, Quayle Crescent, Barnet, Greater London N20 0ER'

In [136]:
# df[df.address.str.contains('Mitcham')]